Server/app/controllers/api/v1/bookings_controller.rb

INSERT INTO "addresses" ("address_line_1", "barangay", "city", "province", "zip_code", "created_at", "updated_at", "profile_id", "booking_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        homeowner = Homeowner.find(booking_params[:homeowner_id])

        custom_format = '%I:%M %p %B %e, %Y %A'
        converted_scheduled_at = DateTime.strptime(booking_params[:scheduled_at], custom_format)

        booking = homeowner.bookings.new(
            service_id: booking_params[:service][:id],
            service_title: booking_params[:service][:title],
            scheduled_at: converted_scheduled_at,
            status: "PENDING",
            total_cost: booking_params[:total_cost].to_f,
            payment_method: booking_params[:payment_method],
        )

        booking_address = booking.build_address(booking_params[:address_attributes])

        if booking.save && booking_address.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
    def find_housemate(booking_data, housemate_id)
        address = booking_data[:address]
        city = address[:city]
        service_id = booking_data[:service][:id]

        nearby_housemates = Housemate.joins(profile: :address).joins(:housemate_services)
            .where(profiles: { addresses: { city: city } })
            .where(is_active: true)
            .where(housemate_services: { service_id: service_id })

        if nearby_housemates.empty?
            render json: { errors: "No nearby available housemate found.", status: :unprocessable_entity }
        else
            index = housemate_id.present? ? nearby_housemates.find_index { |housemate| housemate[:id] == housemate_id } + 1 : 0
            booking = Booking.find(booking_data[:id])