Server/app/controllers/api/v1/bookings_controller.rb

        def show
          user = User.find(params[:id])
          user_bookings = user.bookings
          serialized_user_bookings = user_bookings.map { |booking| serialize_booking(booking) }
---
SELECT "users".* FROM "users" WHERE "users"."type" = $1 AND "users"."id" = $2 LIMIT $3  [["type", "Homeowner"], ["id", 2], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings"

        def find_housemate(booking_data, housemate_id)
          address = booking_data[:address]
          city = address[:city]
          service_id = booking_data[:service][:id]

          nearby_housemates = find_nearby_housemates(city, service_id)
          if nearby_housemates.empty?
            render_error_response("No nearby available housemate found.", :ok)
          else
            index = housemate_id.present? ? nearby_housemates.find_index { |housemate| housemate[:id] == housemate_id } + 1 : 0
            booking = Booking.find(booking_data[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 124], ["LIMIT", 1]]