Server/app/controllers/api/v1/bookings_controller.rb

INSERT INTO "addresses" ("address_line_1", "barangay", "city", "province", "zip_code", "created_at", "updated_at", "profile_id", "booking_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "bookings" ("scheduled_at", "status", "total_cost", "created_at", "updated_at", "housemate_id", "payment_method", "homeowner_id", "service_title", "service_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subservices".* FROM "subservices" WHERE "subservices"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "booking_services" ("quantity", "price_per_quantity", "total", "created_at", "updated_at", "service_id", "subservice_id", "booking_id", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
            def create
                homeowner = Homeowner.find(booking_params[:homeowner_id])

                custom_format = '%I:%M %p %B %e, %Y %A'
                converted_scheduled_at = DateTime.strptime(booking_params[:scheduled_at], custom_format)

                booking = homeowner.bookings.new(
                    service_id: booking_params[:service][:id],
                    service_title: booking_params[:service][:title],
                    scheduled_at: converted_scheduled_at,
                    status: "PENDING",
                    total_cost: booking_params[:total_cost].to_f,
                    payment_method: booking_params[:payment_method],
                )

                booking_address = booking.build_address(booking_params[:address_attributes])

                if booking.save && booking_address.save
                    service = Service.find(booking_params[:service][:id])
                    service_details = []

                    booking_params[:service_details].each do |service_data|
                        subservice = Subservice.find(service_data[:id])
                        subservice_quantity = service_data[:quantity].nil? ? 1 : service_data[:quantity].to_i
                        service_details << BookingService.new(
                            price_per_quantity: subservice.price,
                            quantity: subservice_quantity,
                            title: subservice.title,
                            subservice_id: subservice.id,
                            service_id: service.id,
                            booking_id: booking.id,
                            total: subservice.price.to_f * subservice_quantity,
                        )

SELECT "users".* FROM "users" WHERE "users"."type" = $1 AND "users"."id" = $2 LIMIT $3  [["type", "Housemate"], ["id", 1], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."housemate_id" = $1  [["housemate_id", 1]]
---
            def show
                user = User.find(params[:id])
                if params.has_key?(:booking) && booking_params[:status] === "PENDING"
                    user_bookings = user.bookings.where(status: "PENDING").all
                else
                    user_bookings = user.bookings.all
                end
                serialized_user_bookings = user_bookings.map do |housemate_booking|

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 124], ["LIMIT", 1]]
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", 1], ["updated_at", "2023-10-09 08:57:43.982663"], ["id", 132]]
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", 4], ["updated_at", "2023-10-09 10:22:03.916858"], ["id", 135]]
---
            def update
                unless Booking.statuses.include?(booking_params[:status])
                    render json: { error: "Please input a valid status." , status: :unprocessable_entity }
                    return
                end

                booking = Booking.find(params[:id])

                if booking_params[:housemate_id]
                    housemate = Housemate.find(booking_params[:housemate_id])
                    if booking_params[:status] === "ACCEPTED"
                        booking.assign_attributes(status: booking_params[:status])

                        if booking.save
                            serialized_data = serialize_data(booking)
                            render json: { data: serialized_data, status: :ok }
                        else
                            render json: { errors: booking.errors, status: :unprocessable_entity }
                        end
                    else
                        serialized_data = serialize_data(booking)
                        find_housemate(serialized_data, housemate[:id])
                    end
                else
                    homeowner = Homeowner.find(booking_params[:homeowner_id])
                    booking.assign_attributes(status: booking_params[:status])

                    if booking.save

SELECT "addresses".* FROM "addresses" WHERE "addresses"."booking_id" = $1 LIMIT $2  [["booking_id", 124], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 132], ["LIMIT", 1]]
UPDATE "bookings" SET "updated_at" = $1, "housemate_id" = $2 WHERE "bookings"."id" = $3  [["updated_at", "2023-10-09 08:56:23.909811"], ["housemate_id", 1], ["id", 129]]
UPDATE "bookings" SET "updated_at" = $1, "housemate_id" = $2 WHERE "bookings"."id" = $3  [["updated_at", "2023-10-09 09:10:55.595849"], ["housemate_id", nil], ["id", 134]]
---
            def find_housemate(booking_data, housemate_id)
                address = booking_data[:address]
                city = address[:city]
                service_id = booking_data[:service][:id]

                nearby_housemates = Housemate.joins(profile: :address).joins(:housemate_services)
                    .where(profiles: { addresses: { city: city } })
                    .where(is_active: true)
                    .where(housemate_services: { service_id: service_id })

                if nearby_housemates.empty?
                    render json: { errors: "No nearby available housemate found.", status: :unprocessable_entity }
                else
                    index = housemate_id.present? ? nearby_housemates.find_index { |housemate| housemate[:id] == housemate_id } + 1 : 0
                    booking = Booking.find(booking_data[:id])

                    if index < nearby_housemates.length
                        booking.assign_attributes(housemate_id: nearby_housemates[index][:id])
                    else
                        booking.update(housemate_id: "")
                        render json: { errors: "No nearby available housemate found.", status: :unprocessable_entity }
                        return
                    end

                    if booking.save

SELECT "booking_services".* FROM "booking_services" WHERE "booking_services"."booking_id" = $1  [["booking_id", 121]]
---
            def serialize_data(booking)
                booking_services_data = booking.booking_services.all.each do |booking_service|