Server/app/controllers/api/v1/housemate_services_controller.rb

INSERT INTO "housemate_services" ("created_at", "updated_at", "email", "service_title", "housemate_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2023-10-06 15:00:22.998916"], ["updated_at", "2023-10-06 15:00:22.998916"], ["email", "test@test.com"], ["service_title", "Cleaning Services"], ["housemate_id", 1]]
SELECT "housemate_services".* FROM "housemate_services" WHERE "housemate_services"."housemate_id" = $1  [["housemate_id", 1]]
---
            def create
                housemate = Housemate.find(housemate_services_params[:id])

                begin
                    housemate_services = []
                    housemate_services_params[:services].each do |housemate_service|
                      housemate_services << housemate.housemate_services.new(
                        email: housemate.email,
                        service_id: housemate_service[:id],
                        service_title: housemate_service[:title])
                    end
                    HousemateService.transaction do
                      housemate_services.each(&:save!)
                    end
                    housemate_services_data = housemate.housemate_services.all.each do |house_service|