Server/app/controllers/api/v1/profiles_controller.rb

    def create
        user = User.find(profile_params[:id])
        if user
            profile = user.build_profile(profile_params.merge(user_id: user.id))
            address = profile.build_address(profile_params[:address_attributes])
            if profile.save && address.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "addresses" ("address_line_1", "barangay", "city", "province", "zip_code", "created_at", "updated_at", "profile_id", "booking_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "profiles" ("id", "name", "phone_number", "created_at", "updated_at", "user_id", "email") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["id", 1], ["name", nil], ["phone_number", nil], ["created_at", "2023-10-08 09:47:35.539200"], ["updated_at", "2023-10-08 09:47:35.539200"], ["user_id", 1], ["email", "housemate@test.com"]]

    def show
        user = User.find(profile_params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]