Server/app/controllers/api/v1/profiles_controller.rb

    def create
        user = User.find_by(email: profile_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]