Server/app/controllers/api/v1/services_controller.rb

SELECT "services".* FROM "services" ORDER BY "services"."id" ASC
---
            def index
                services = Service.order(:id)

INSERT INTO "services" ("title", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Aircon Services"], ["created_at", "2023-10-06 11:41:10.901983"], ["updated_at", "2023-10-06 11:41:10.901983"], ["price", "699.0"]]
---
            def create
                service = Service.new(service_params)
                if service.save

UPDATE "services" SET "title" = $1, "updated_at" = $2, "price" = $3 WHERE "services"."id" = $4  [["title", "wow"], ["updated_at", "2023-10-10 02:02:00.496925"], ["price", "200.0"], ["id", 2]]
---
            def update
                if @service.update(service_params)

SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            def get_specific_service
                @service = Service.find(params[:id])