Server/app/controllers/api/v1/subservices_controller.rb

            def create
                service = Service.find(subservice_params[:service_id])
                subservice = service.subservices.new(subservice_params)
                if subservice.save
---
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "subservices" ("title", "price", "created_at", "updated_at", "service_id", "housemate_service_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Disinfectant Spraying"], ["price", "699.0"], ["created_at", "2023-10-06 11:58:10.866259"], ["updated_at", "2023-10-06 11:58:10.866259"], ["service_id", 1], ["housemate_service_id", nil]]

            def show
                service = Service.find(params[:id])
                subservices = service.subservices.all
---
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "services".* FROM "services" LIMIT $1  [["LIMIT", 1]]
SELECT "subservices".* FROM "subservices" WHERE "subservices"."service_id" = $1  [["service_id", 1]]

            def update
                subservice = Subservice.find(params[:id])
                if subservice.update(subservice_params)
---
SELECT "subservices".* FROM "subservices" WHERE "subservices"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subservices" SET "title" = $1, "price" = $2, "updated_at" = $3, "category" = $4 WHERE "subservices"."id" = $5  [["title", "Laundry"], ["price", "18.0"], ["updated_at", "2023-10-10 22:00:16.095527"], ["category", "Home Type"], ["id", 3]]